[String]
IDS_MENU_PROJECT      = &Project
IDS_MENU_PROJECT_NEW  = &New Project
IDS_MENU_PROJECT_OPEN = &Open Project
IDS_MENU_PROJECT_SAVE = &Save Project
IDS_MENU_EXIT         = &Exit

IDS_MENU_FILE         = &File
IDS_MENU_FILE_ADD     = &Add File
IDS_MENU_FILE_MODIFY  = &Modify File
IDS_MENU_FILE_REMOVE  = &Remove File

IDS_MENU_PROTECT      = &Protect
IDS_MENU_PROTECT_CUR  = Protect &Current File
IDS_MENU_PROTECT_ALL  = Protect &All Files

IDS_MENU_LANG         = &Language

IDS_MENU_VIEW         = &View
IDS_MENU_VIEW_TOOL    = &ToolBar
IDS_MENU_VIEW_STATUS  = &StatusBar

IDS_MENU_HELP         = &Help
IDS_MENU_HELP_ABOUT   = &About

IDS_STATUS_PROJECT_NEW  = Create a new project
IDS_STATUS_PROJECT_OPEN = Open a project file
IDS_STATUS_PROJECT_SAVE = Save to a project file
IDS_STATUS_EXIT         = Exit this program
IDS_STATUS_FILE_ADD     = Add a file to be protected
IDS_STATUS_FILE_MODIFY  = Modify file path
IDS_STATUS_FILE_REMOVE  = Remove a file from the list
IDS_STATUS_PROTECT_CUR  = protect current file
IDS_STATUS_PROTECT_ALL  = protect all files
IDS_STATUS_VIEW_TOOL    = Show or hide toolbar
IDS_STATUS_VIEW_STATUS  = Show or hide statusbar
IDS_STATUS_ABOUT        = Show version and copyright information

IDS_MAINFRM_ERRTITLE           = Error
IDS_MAINFRM_HADRUN             = The program is already running!
IDS_MAINFRM_STR1               = The run for lack of the necessary files
IDS_MAINFRM_STR2               = Error running RockeyCmdShell.exe
IDS_MAINFRM_UNSUPPORT_WIN32PE  = Unsupport win32 PE file on this dongle
IDS_MAINFRM_UNSUPPORT_WIN64PE  = Unsupport win64 PE file on this dongle
IDS_MAINFRM_UNSUPPORT_WIN32NET = Unsupport win32 .Net file on this dongle
IDS_MAINFRM_UNSUPPORT_WIN64NET = Unsupport win64 .Net file on this dongle
IDS_MAINFRM_PACKED             = This file may have been packed! If you encrypt it again, it may not run.

IDS_LISTVIEW_COLUMN_1   = Index
IDS_LISTVIEW_COLUMN_2   = Type
IDS_LISTVIEW_COLUMN_3   = Import File
IDS_LISTVIEW_COLUMN_4   = Export File
IDS_LISTVIEW_COLUMN_5   = Result
IDS_LISTVIEW_STR1       = OK
IDS_LISTVIEW_STR2       = Error
IDS_LISTVIEW_WIN32PE      = PE32
IDS_LISTVIEW_WIN64PE      = PE64
IDS_LISTVIEW_WIN32DOTNET  = .Net32
IDS_LISTVIEW_WIN64DOTNET  = .Net64
IDS_LISTVIEW_WIN32DP_DATA = DATA32
IDS_LISTVIEW_WIN64DP_DATA = DATA64

IDS_DIALOG_TYPE_TITLE      = Model Selection
IDS_DIALOG_TYPE_STR1       = Choose a dongle model
IDS_DIALOG_DONGLE_ET99     = ET99/ET99 Time/ET299
IDS_DIALOG_DONGLE_ET199    = ET199
IDS_DIALOG_TYPE_BTN_OK     = OK
IDS_DIALOG_TYPE_BTN_CANCEL = Cancel

IDS_DIALOG_FILE_TITLE        = File Path
IDS_DIALOG_FILE_STR1         = Input File:
IDS_DIALOG_FILE_STR2         = Output File:
IDS_DIALOG_FILE_STR3         = Select a File Type:
IDS_DIALOG_FILE_STR4         = Error
IDS_DIALOG_FILE_STR5         = Please specify a file to be protected.
IDS_DIALOG_FILE_STR6         = Please specify a path to the protected file.
IDS_DIALOG_FILE_STR7         = Program
IDS_DIALOG_FILE_STR8         = Data
IDS_DIALOG_FILE_BTN_OK       = OK
IDS_DIALOG_FILE_BTN_CANCEL   = Cancel
 
IDS_DIALOG_METHOD_TITLE        = Select a function to be encrypted
IDS_DIALOG_METHOD_BTN_OK       = OK
IDS_DIALOG_METHOD_BTN_CANCEL   = Cancel 
IDS_DIALOG_METHOD_ERR1         = You must choose at least one method to encrypt
 
IDS_DIALOG_ABOUT_TITLE     = About
IDS_DIALOG_ABOUT_STR1      = Product:
IDS_DIALOG_ABOUT_STR2      = Version:
IDS_DIALOG_ABOUT_STR3      = Company:
IDS_DIALOG_ABOUT_STR4      = Website:
IDS_DIALOG_ABOUT_STR5      = Envelope Protection Center

IDS_SHELLOPTION_PE_TITLE      = PE Envelope Option
IDS_SHELLOPTION_PE_ITEM1      = Anti Debug
IDS_SHELLOPTION_PE_DESC1      = Enable Anti Debug
IDS_SHELLOPTION_PE_ITEM2      = Check Parent
IDS_SHELLOPTION_PE_DESC2      = Enable Check Parent Process
IDS_SHELLOPTION_PE_ITEM3      = Replace Code
IDS_SHELLOPTION_PE_DESC3      = Enable Code Replacement
IDS_SHELLOPTION_PE_ITEM4      = File Protect
IDS_SHELLOPTION_PE_DESC4      = Enable File Protection
IDS_SHELLOPTION_YES           = Yes
IDS_SHELLOPTION_NO            = No

IDS_SHELLOPTION_NET_TITLE     = .NET Envelope Option
IDS_SHELLOPTION_NET_ITEM1     = Algorithm
IDS_SHELLOPTION_NET_DESC1     = Choose an algorithm
IDS_SHELLOPTION_NET_ITEM2     = RedisposeStrongName
IDS_SHELLOPTION_NET_DESC2     = Enable RedisposeStrongName
IDS_SHELLOPTION_NET_ITEM3     = CreateNewStrongName
IDS_SHELLOPTION_NET_DESC3     = Enable CreateNewStrongName
IDS_SHELLOPTION_NET_ITEM4     = StrongFileName
IDS_SHELLOPTION_NET_DESC4     = Type a StrongFile Name
IDS_SHELLOPTION_NET_ITEM5     = Encrypt BLOB Data
IDS_SHELLOPTION_NET_DESC5     = Enable Encrypt BLOB Data
IDS_SHELLOPTION_NET_ITEM6     = Encrypt String Data
IDS_SHELLOPTION_NET_DESC6     = Enable Encrypt String Data
IDS_SHELLOPTION_NET_ITEM7     = Encrypt Resource Data
IDS_SHELLOPTION_NET_DESC7	    = Enable Encrypt Resource Data
IDS_SHELLOPTION_NET_ITEM8     = Encrypt Method Body
IDS_SHELLOPTION_NET_DESC8	    = Enable Encrypt Method Body
IDS_SHELLOPTION_NET_ITEM9     = Method List
IDS_SHELLOPTION_NET_DESC9     = Check to specify methods to be encrypted
IDS_SHELLOPTION_NET_ENCALL    = Encrypt All
IDS_SHELLOPTION_NET_ENCSOME   = Encrypt Some
IDS_SHELLOPTION_NET_ENCNOTHING= Encrypt Nothing

IDS_SHELLOPTION_DPD_TITLE     = DataProtect Option
IDS_SHELLOPTION_DPD_ITEM1     = Algorithm
IDS_SHELLOPTION_DPD_DESC1     = Choose an algorithm
IDS_SHELLOPTION_DPD_ITEM2     = OS Select
IDS_SHELLOPTION_DPD_DESC2     = Please Select WIN32 or WIN64

IDS_ET99_MSG_TITLE   = Error
IDS_ET99_MSG_NOKEY   = Cannot find dongle
IDS_ET99_MSG_PINERR  = User Pin Verification Failed
IDS_ET99_MSG_EXPIRE  = Dongle Time License Expired
IDS_ET99_MSG_RTCSTOP = Dongle RTC had Stoped
IDS_ET99_NAME_1      = PID
IDS_ET99_DESC_1      = Please input PID
IDS_ET99_NAME_2      = User Pin
IDS_ET99_DESC_2      = Specify a User Pin. Do not modify it after encrypting a file.
IDS_ET99_NAME_3      = Bind HID
IDS_ET99_DESC_3      = Enable bind to Dongle HID
IDS_ET99_NAME_4      = HID
IDS_ET99_DESC_4      = Please Input HID to bind
IDS_ET99_NAME_5      = Background Check
IDS_ET99_DESC_5      = Enable Dongle Background Check
IDS_ET99_NAME_6      = Time intervals
IDS_ET99_DESC_6      = Specify a background check interval (in seconds)
IDS_ET99_NAME_7      = Message Title
IDS_ET99_DESC_7      = Specify a title for the error message box.
IDS_ET99_NAME_8      = MSG of No Dongle 
IDS_ET99_DESC_8      = Specify a message used when the dongle is not found.
IDS_ET99_NAME_9      = MSG of PIN Error 
IDS_ET99_DESC_9      = Specify a message used when the PIN is incorrect.
IDS_ET99_NAME_10     = MSG of Lic Expired 
IDS_ET99_DESC_10     = Specify a message used when the license has expired.
IDS_ET99_NAME_11     = MSG of RTC Stoped 
IDS_ET99_DESC_11     = Specify a message used when RTC has stoped.

IDS_ET199_MSG_TITLE   = Error
IDS_ET199_MSG_NOKEY   = Cannot find dongle
IDS_ET199_NAME_1      = CustomNum
IDS_ET199_DESC_1      = Please input CustomNum
IDS_ET199_NAME_2      = Bind HID
IDS_ET199_DESC_2      = Enable bind to Dongle HID
IDS_ET199_NAME_3      = HID
IDS_ET199_DESC_3      = Please Input HID to bind
IDS_ET199_NAME_4      = Background Check
IDS_ET199_DESC_4      = Enable Dongle Background Check
IDS_ET199_NAME_5      = Time intervals
IDS_ET199_DESC_5      = Specify a background check interval (in seconds)
IDS_ET199_NAME_6      = Message Title
IDS_ET199_DESC_6      = Specify a title for the error message box
IDS_ET199_NAME_7      = MSG of No Dongle 
IDS_ET199_DESC_7      = Specify a message used when the dongle is not found.

